FI/Kertomustiedot/Integraatiopalvelu_Kertomustiedot_Esimerkkisanoma_InsertEPRData_InsertEPRDataRequest_3.0.0

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.EPRDocumentService" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.EPRDocumentService.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:InsertEPRDataRequest>
         <lif:MessageHeader>
            <lif1:MessageID/>
            <lif1:TransactionID/>
            <lif1:SenderID/>
            <lif1:SenderApplication/>
            <lif1:ReceiverID/>
            <lif1:ReceiverApplication/>
            <lif1:CharacterSet/>
            <lif1:DataServiceURL/>
            <lif1:UserLanguageCode/>
            <lif1:VersionNumber/>
         </lif:MessageHeader>
         <lif:Common>
            <lif1:ContractKey>yyy</lif1:ContractKey>
            <lif1:CallingSystem>xxx</lif1:CallingSystem>
            <lif1:Area>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>2101Y</lif1:CodeValue>
               <lif1:CodeDescription/>
            </lif1:Area>
            <lif1:UserIdentifiers>
               <lif1:UserIdentifier>
                  <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                  <lif1:UserIdentifierCode>diibadaaba</lif1:UserIdentifierCode>
                  <lif1:FamilyName/>
                  <lif1:GivenNames/>
                  <lif1:Profession/>
               </lif1:UserIdentifier>
            </lif1:UserIdentifiers>
            <lif1:Function>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>ESH</lif1:CodeValue>
               <lif1:CodeDescription/>
            </lif1:Function>
            <lif1:ReasonCode>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>1</lif1:CodeValue>
               <lif1:CodeDescription></lif1:CodeDescription>
            </lif1:ReasonCode>
         </lif:Common>
         <lif:Contact>
            <lif2:PatientId>
               <lif2:Identifier>301255-9019</lif2:Identifier>
            </lif2:PatientId>
            <lif2:VisitTime>2015-03-27T09:00:00</lif2:VisitTime>
            <lif2:ContactAuthor>               
               <lif1:UserIdentifier>
                  <lif1:UserIdentifierCodeId>SV_CODE</lif1:UserIdentifierCodeId>
                  <lif1:UserIdentifierCode>12345</lif1:UserIdentifierCode>
                  <lif1:FamilyName/>
                  <lif1:GivenNames/>
                  <lif1:Profession/>
               </lif1:UserIdentifier>
            </lif2:ContactAuthor>
            <lif2:Organisation>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>317</lif1:CodeValue>
               <lif1:CodeDescription></lif1:CodeDescription>
            </lif2:Organisation>
            <lif2:Area>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>2101Y</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:Area>
            <lif2:Form>KIRU</lif2:Form>
            <lif2:Function>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>ESH</lif1:CodeValue>
               <lif1:CodeDescription></lif1:CodeDescription>
            </lif2:Function>
            <lif2:Speciality>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>30</lif1:CodeValue>
               <lif1:CodeDescription></lif1:CodeDescription>
            </lif2:Speciality>
            <lif2:ServiceEvent>
               <lif1:CodeSetName>THL</lif1:CodeSetName>
               <lif1:CodeSetId/>
               <lif1:CodeValue>1.2.246.10.19623654.10.1.12345.2014.1234</lif1:CodeValue>
               <lif1:CodeDescription></lif1:CodeDescription>
            </lif2:ServiceEvent>
            <lif2:DataState>F</lif2:DataState>
            <lif2:CareProcesState>HOIDON_SUUNNITTELU</lif2:CareProcesState>
            <lif2:ContactRows>
               <lif2:ContactRow>
                  <lif2:HeadingName>Esitiedot</lif2:HeadingName>
                  <lif2:Data>Testing testing</lif2:Data>
                  <lif2:Value/>
                  <lif2:Specifier/>
               </lif2:ContactRow>
            </lif2:ContactRows>
         </lif:Contact>
      </lif:InsertEPRDataRequest>
   </soapenv:Body>
</soapenv:Envelope>